from django.core.management.base import BaseCommand
from myapp1.models import Students

class Command(BaseCommand):
    help = 'Populate Students table with data'

    def handle(self, *args, **options):
        students_data = [
            (1, 'Сидоренко', 'Іван', 'Петрович', 'вул. Героїв України, 123', '1234567890', 1, 'аграрного менеджменту',
             'Група1', 1),
            (2, 'Петренко', 'Марія', 'Олександрівна', 'вул. Шевченка, 45', '1234567891', 2, 'економіки', 'Група2', 0),
            (3, 'Іванов', 'Олег', 'Васильович', 'вул. Пушкіна, 67', '1234567892', 3, 'інформаційних технологій',
             'Група3', 0),
            (4, 'Павленко', 'Наталія', 'Ігорівна', 'вул. Гагаріна, 34', '1234567893', 1, 'аграрного менеджменту',
             'Група1', 0),
            (5, 'Григоров', 'Володимир', 'Андрійович', 'вул. Лесі Українки, 56', '1234567894', 2, 'економіки', 'Група2',
             0),
            (6, 'Сергієнко', 'Тетяна', 'Михайлівна', 'вул. Лермонтова, 78', '1234567895', 3, 'інформаційних технологій',
             'Група3', 0),
            (7, 'Мельник', 'Андрій', 'Віталійович', 'вул. Шкільна, 12', '1234567896', 1, 'аграрного менеджменту',
             'Група1', 0),
            (8, 'Коваленко', 'Ольга', 'Володимирівна', 'вул. Петра Порошенка, 23', '1234567897', 2, 'економіки',
             'Група2', 0),
            (9, 'Біленька', 'Юлія', 'Вікторівна', 'вул. Січових Стрільців, 8', '1234567898', 3,
             'інформаційних технологій', 'Група3', 0),
            (10, 'Козаченко', 'Дмитро', 'Сергійович', 'вул. Шевченка, 34', '1234567899', 1, 'аграрного менеджменту',
             'Група1', 0),
            (11, 'Захаренко', 'Оксана', 'Андріївна', 'вул. Першотравнева, 56', '1234567800', 2, 'економіки', 'Група2', 0)
        ]

        for data in students_data:
            student = Students(
                Student_id=data[0],
                Student_surname=data[1],
                Student_name=data[2],
                Student_lastname=data[3],
                Student_address=data[4],
                Student_phone=data[5],
                Course=data[6],
                Faculty=data[7],
                Student_group=data[8],
                isHead=data[9]
            )
            student.save()

        self.stdout.write(self.style.SUCCESS('Successfully populated Students table'))
